Revit 2024 API
InsulationTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual InsulationTypeSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As InsulationTypeSetIterator
Visual C++
public:
virtual InsulationTypeSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
InsulationTypeSet Class
Autodesk.Revit.DB.Electrical Namespace